let origin = `
• הובלות ומשלוחים
הובלות על הדרך, שילוב הובלה, הובלות בעלי חיים, הובלת דירה, פירוק והובלת רהיטים, הובלה עם מנוף,  שירותי גרירה, הובלות בטון, פינוי פסולת, אחר

• אחזקת הבית
תיקונים, הרכבות, הנדימן, אחר

• תיקון מוצרי חשמל
מקרר, מזגן, תנור, כיריים, דוד שמש, דוד חשמלי, קולטי שמש,  אינטרקום, מכונת כביסה, מייבש כביסה, טלוויזיות, מיקרוגל, מדיח כלים, שואב אבק, אחר

• חלונות ותריסים
תיקון חלונות אלומיניום, תיקון ושיקום חלונות עץ, מכירה והתקנה, אחר

• דלתות
מכירה והתקנה, דלתות עץ, דלתות אלומיניום, תיקון ושיקום, אחר

• פרגולות
פרגולות עץ, עבודות עץ, בנייה, פרגולות אלומיניום, צביעה ושיקום, אחר

• תאורה
תאורה ביתית, תאורה תעשייתית, תאורה סולארית, תאורת רחוב, אחר

• אינסטלטור
עבודת אינסטלציה, פתיחת סתימות, תיקון והחלפת ברזים, תיקון והתקנת מקלחונים, התקנת אמבטיות, תיקון והחלפת צנרת, אחר

• מנעולן
מנעולן רכב, מנעולן כספות, שכפול מפתחות ושלטים, החלפת מנעולים, תיקון מנעולים, אחר

• גינון ונוי
גינון ופיתוח, תכנון ועיצוב גינה, גיזום, אחר

• ניקיון
ניקוי בית, ניקוי בריכות, ניקוי חדר מדרגות, אחר

• שיפוצים וצביעה
שיפוצים מוסדיים, שיפוצים כלליים, עבודות גבס, הריסה ופינוי, צביעת פנים, צביעת חוץ, חיפויים דקורטיביים, אחר

• איטום ותיקון גגות
איטום ובידוד, תיקון נזילות, איטום בריכות שחייה, איטום שקוף, אחר

• הדברה
הדברת מזיקים, הדברה אורגנית, הדברת צמחייה, הדברת בקר, אחר

• מחשבים וסלולר
תיקון מחשבים, תיקון סלולרי, מכירת אביזרים, מצלמות אבטחה, מערכת אזעקה לבית ולעסק, אחר

• בנייה
אדריכלים, מהנדסים, מנהלי עבודה, מפקחי בנייה, מעצבי פנים, מעצבי חוץ, אחר

• חשמלאי
חשמלאי תעשייתי, חשמלאי ביתי, אחר

• טכנאי גז
מתקין גז תעשייתי, מתקין גז ביתי, בדיקה והתקנה מוצרי גז, אחר

• מורים ומאמנים
מורים פרטיים, מאמנים אישיים, אחר

• רכב
פחחות וצביעה, תיקון תאונה, חלקי חילוף, אחר

• צילום
צילום אירועים, סדנאות צילום, צילום אישי, אחר`;

const originParts = origin.split('\n• ');

const result = originParts.filter(part => !!part).map(part => {

    return part.split('\n').filter(chunk => !!chunk.trim && !!chunk.trim());
}).map(part => {

    return {
        name: part[0],
        subs: part[1].split(',').map(sub => sub.trim())
    };
});
console.log('result', JSON.stringify(result));